dh-04/Maxim32550/03BFII-41/03Ref/Examples_MAX32550/blink_led/src/_write.c
/*
 * @file _write.c
 *
 ******************************************************************************
 * Copyright (C) 2016-2018 Maxim Integrated Products, Inc., All rights Reserved.
 *
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 ******************************************************************************
 */

#include <MAX325xx.h>
#include <errno.h>
#include "diag/Trace.h"

ssize_t
_write(int fd, const char* buf, size_t nbyte);

ssize_t _close_r(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused)));

ssize_t _lseek_r(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused)));

ssize_t _read(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused)));

ssize_t _fstat_r(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused)));

ssize_t _isatty_r(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused)));


ssize_t _write(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused))) {
	size_t CharCnt = 0x00;

	for (; nbyte > 0x00; --nbyte) {
		if (*(uint8_t*) buf == '\n') {
			mml_uart_write_char(MML_UART_DEV0, '\r');
		}
		mml_uart_write_char(MML_UART_DEV0, (unsigned char) *(uint8_t*) buf);
		(uint8_t*) buf++; /* Increase buffer pointer */
		CharCnt++; /* Increase char counter */
	}

	return CharCnt;
}

ssize_t _close_r(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused))) {
	return 0;
}

ssize_t _lseek_r(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused))) {
	return 0;
}

ssize_t _read(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused))) {
	int result;
	size_t CharCnt = 0x00;

	test: result = mml_uart_read_char(MML_UART_DEV0,
			(unsigned char*) (uint8_t*) buf);
	/* Check if character sent is correct */
	if (result == NO_ERROR) {
		(unsigned char*) buf++; /* Increase buffer pointer */
		CharCnt++; /* Increase char counter */
	} else
		goto test;
	return CharCnt;
}

ssize_t _fstat_r(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused))) {
	return 0;
}

ssize_t _isatty_r(int fd __attribute__((unused)),
		const char* buf __attribute__((unused)),
		size_t nbyte __attribute__((unused))) {
	return 0;
}
